content/emacs/modes/gnu-global-manual.org
# -*- coding:utf-8-*-
#+TITLE:GNU Global manual
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com

* 概述
  GNU Global 是一个源代码标记系统，以相同的方式工作在不同的环境中，比如 Emacs editor, Vi editor, Less viewer, Bash shell, various web browsers 等等。可以用来定位指定的符号，比如函数（function）、宏（macros）、结构体（struct）、类（class），并轻松跳转。对于包含很多子目录，有很多 =#ifdef= 和 =main()= 函数的大型项目是很有用的。它类似 ctags 或者 etags，不同之处在于其独立于编辑器。

  GNU GLOBAL 将包含子目录的源码树视为项目。在项目的任意地方都可以使用一个高性能的 tag 数据库。不需要指定数据库的位置，global 会自行定位。由于这个特性，可以在项目中内和项目间自由切换。

  GNU GLOBAL 具有以下功能：
  + 支持 C，C ++，Yacc，Java，PHP4 和 assembly。
  + 以相同的方式工作在的环境中：
    - Shell 命令行
    - Bash shell
    - Vi 编辑器（Nvi，Elvis，vim）
    - Less viewer
    - Emacs 编辑器（Emacs，Mule，Xemacs）
    - 网页浏览器
    - Doxygen 文档系统
  + 快速查找指定符号（symbol）位置。
  + 定位 symbol 定义和引用。
  + 允许重复 tag。
  + 查找匹配指定模式的路径。
  + 默认分层搜索。
  + 搜索工程源码和依赖的库源码。
  + 为补全输入方法生成补全列表。
  + 支持多种输出格式。
  + 允许自定义用来标记的候选文件。
  + 支持 POSIX 1003.2 正则表达式。
  + 支持 idutils 作为外部的搜索引擎。
  + tag 文件独立于机器架构。
  + 支持增量更新标记文件。
  + 通过解析器插件来支持新语言。
  + 通过 gtags.conf 来进行定制。
  + 为源码生成超文本文件。
  + 格式紧凑，节省磁盘空间。
  + 支持客户端/服务器环境（使用 Tramp）。
  + 忽略二进制文件、点文件和指定文件。
  + 包含兼容 cscope 的程序（gtags-cscope）。
  + 包含 grep-like 命令（-g command）。
  + 支持 grep-like 符号高亮。

* Command line
  可以通过命令行使用 tag 工具。和其他 tag 系统相比，这是 Global 的一大优点。
** 准备工作
   开始前，先去阅读 FAQ 文件。
   #+BEGIN_SRC sh
more /usr/local/share/gtags/FAQ
   #+END_SRC

   首先必须在源码树根目录执行 gtags，例如，如果想浏览 FreeBSD 中 vi 编辑器源码，请在源码目录中调用 gtags。
   #+BEGIN_SRC sh
cd /usr/src/usr.bin/vi
gtags
   #+END_SRC

   gtags 遍历子目录，从源码文件中提取符号，在当前目录生成三个 tag 文件。

   + GTAGS    定义数据库
   + GRTAGS   引用数据库
   + GPATH    路径名数据库

   此后，当前目录中的所有文件和目录都会被当作一个项目。

   应该为 tag 文件准备相当大的磁盘空间，例如，linux-2.6.32 源码需以下磁盘空间：

   #+BEGIN_EXAMPLE
source code(Linux-2.6.32)       390MB

GPATH                             6MB
GTAGS                            81MB
GRTAGS                          202MB
-------------------------------------
total of tag files              289MB
   #+END_EXAMPLE

** 基本使用
*** 查找定义
    #+BEGIN_EXAMPLE
$global func1
DIR1/fileB.c            # func1() is defined in fileB.c
    #+END_EXAMPLE

*** 查找引用
    使用 =-r= 查找引用：
    #+BEGIN_EXAMPLE
$global -r func2
../DIR1/fileA.c         # func2() is referred from fileA.c
    #+END_EXAMPLE

*** 使用 POSIX 正则表达式
    #+BEGIN_EXAMPLE
$global 'func[1-3]'
DIR1/fileB.c            # func1, func2 and func3 are matched
DIR2/fileC.c
    #+END_EXAMPLE

*** 查看详细内容
    =-x= 选项显示详细信息。它类似于 ctags 的 =-x= 选项

    #+BEGIN_EXAMPLE
$global func2
DIR2/fileC.c
$global -x func2
func2              2 DIR2/fileC.c       func2(){ i++; }
func2              4 DIR2/fileC.c       func2(){ i--; }
    #+END_EXAMPLE

*** 显示绝对路径
    #+BEGIN_EXAMPLE
$global -a func1
/home/user/ROOT/DIR1/fileB.c
    #+END_EXAMPLE

*** 查找符号
    =-s= 命令用于查找未在 GTAGS 中定义的符号。
    #+BEGIN_EXAMPLE
$ global -xs X
X                  1 DIR2/fileC.c #ifdef X
    #+END_EXAMPLE

*** 查找指定模式的行
    =-g= 命令定位具有指定模式的行。
    #+BEGIN_EXAMPLE
$ global -xg '#ifdef'
#ifdef             1 DIR2/fileC.c #ifdef X

    #+END_EXAMPLE

    它类似于 egrep，但对于源代码读取来说更方便，因为它允许通过项目搜索，并且仅在源文件中搜索。
    此外，可以使用各种选项：
    + =-O=
      仅在文本文件中搜索。
    + =-o=
      搜索源文件和文本文件。
    + =-l=
      仅在当前目录下搜索。

    -e，-G 和 - i 选项也可用。 用法与 egrep 几乎相同。

    甚至可以使用 ~--result=grep~ 选项将 global 的输出格式更改为 grep 样式。 当然，这些选项甚至可以被其他命令使用。

*** 查找执行模式的路径
    =-P= 命令定位包含指定模式的路径名。
    #+BEGIN_EXAMPLE
$ global -P fileB
DIR1/fileB.c
$ global -P '1/'
DIR1/fileA.c
DIR1/fileB.c
$ global -P '\.c$'
DIR1/fileA.c
DIR1/fileB.c
DIR2/fileC.c
    #+END_EXAMPLE

*** 在指定文件中查找符号
    =-f= 命令在打印存在指定 tags 的文件列表。
    #+BEGIN_EXAMPLE
$ global -f DIR2/fileC.c
func2              2 DIR2/fileC.c   func2(){ i++; }
func2              4 DIR2/fileC.c   func2(){ i--; }
func3              6 DIR2/fileC.c   func3(){
    #+END_EXAMPLE

*** 限制搜索范围
    =-l= 选项限制仅在当前目录下的检索。
    #+BEGIN_EXAMPLE
$cd DIR1
$ global -xl func[1-3]
func1        1 fileB.c      func1(){...}
    #+END_EXAMPLE

