emacs/modes/gnu-global-manual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-10 二 19:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GNU Global manual</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">GNU Global manual</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge03f913">1. 概述</a></li>
<li><a href="#orgdf2bb82">2. Command line</a>
<ul>
<li><a href="#org5da3814">2.1. 准备工作</a></li>
<li><a href="#org325485b">2.2. 基本使用</a>
<ul>
<li><a href="#orgdcab8b8">2.2.1. 查找定义</a></li>
<li><a href="#orga7f4355">2.2.2. 查找引用</a></li>
<li><a href="#org206a259">2.2.3. 使用 POSIX 正则表达式</a></li>
<li><a href="#org542ee15">2.2.4. 查看详细内容</a></li>
<li><a href="#org372b1c0">2.2.5. 显示绝对路径</a></li>
<li><a href="#org922e73f">2.2.6. 查找符号</a></li>
<li><a href="#orgfade21d">2.2.7. 查找指定模式的行</a></li>
<li><a href="#orga18f794">2.2.8. 查找执行模式的路径</a></li>
<li><a href="#org8e6b27c">2.2.9. 在指定文件中查找符号</a></li>
<li><a href="#orgf027061">2.2.10. 限制搜索范围</a></li>
</ul>
</li>
<li><a href="#orgd894993">2.3. 高级使用</a></li>
</ul>
</li>
<li><a href="#org9e51d04">3. Various applications</a>
<ul>
<li><a href="#org08d09de">3.1. 针对 Bash 的 Global 功能</a></li>
<li><a href="#org297ba53">3.2. Less 使用 GLOBAL</a></li>
<li><a href="#org3f8873e">3.3. Nvi-1.81.5 使用 GLOBAL</a></li>
<li><a href="#orgc43e983">3.4. Elvis 使用 GLOBAL</a></li>
<li><a href="#org0354e7b">3.5. Vim 使用 GLOBAL</a></li>
<li><a href="#org128198b">3.6. 使用 GLOBAL 扩展 Emacs</a>
<ul>
<li><a href="#org02e4def">3.6.1. 特性</a></li>
<li><a href="#org1731474">3.6.2. 准备</a></li>
<li><a href="#org29d71b2">3.6.3. 使用</a></li>
</ul>
</li>
<li><a href="#org3873603">3.7. Gtags-cscope</a></li>
<li><a href="#org420bb0d">3.8. 超文本生成器</a></li>
<li><a href="#org06d6471">3.9. Doxygen 使用 GLOBAL</a></li>
</ul>
</li>
<li><a href="#org7c91ffd">4. Command References</a>
<ul>
<li><a href="#orge0b1838">4.1. global - 打印给定符号未知</a></li>
<li><a href="#org551dff6">4.2. gtags - 为 global 创建 tag 文件</a></li>
<li><a href="#orge2ee9aa">4.3. htags - 从源文件生成超文本</a></li>
<li><a href="#org55d1212">4.4. htags-server - 为 htags 启动专用 Web/CGI server</a></li>
<li><a href="#org70ee11b">4.5. gozilla - 强制浏览器显示源文件的指定部分</a></li>
<li><a href="#orgb34bc43">4.6. gtags-cscope - 交互式地检查一个 C 程序</a></li>
<li><a href="#org4c13da1">4.7. globash - 使用 GNU bash 的 GLOBAL 特殊 shell</a></li>
<li><a href="#org15a59ac">4.8. gtags.conf - GNU GLOBAL 的配置数据</a>
<ul>
<li><a href="#org09d1079">4.8.1. 变量替代</a></li>
<li><a href="#org68d6e25">4.8.2. 包含其他记录</a></li>
<li><a href="#org687147d">4.8.3. 配置项</a></li>
<li><a href="#orgd8f5e2c">4.8.4. 环境变量</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge03f913" class="outline-2">
<h2 id="orge03f913"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
GNU Global 是一个源代码标记系统，以相同的方式工作在不同的环境中，比如 Emacs editor, Vi editor, Less viewer, Bash shell, various web browsers 等等。可以用来定位指定的符号，比如函数（function）、宏（macros）、结构体（struct）、类（class），并轻松跳转。对于包含很多子目录，有很多 <code>#ifdef</code> 和 <code>main()</code> 函数的大型项目是很有用的。它类似 ctags 或者 etags，不同之处在于其独立于编辑器。
</p>

<p>
GNU GLOBAL 将包含子目录的源码树视为项目。在项目的任意地方都可以使用一个高性能的 tag 数据库。不需要指定数据库的位置，global 会自行定位。由于这个特性，可以在项目中内和项目间自由切换。
</p>

<p>
GNU GLOBAL 具有以下功能：
</p>
<ul class="org-ul">
<li>支持 C，C ++，Yacc，Java，PHP4 和 assembly。</li>
<li>以相同的方式工作在的环境中：
<ul class="org-ul">
<li>Shell 命令行</li>
<li>Bash shell</li>
<li>Vi 编辑器（Nvi，Elvis，vim）</li>
<li>Less viewer</li>
<li>Emacs 编辑器（Emacs，Mule，Xemacs）</li>
<li>网页浏览器</li>
<li>Doxygen 文档系统</li>
</ul></li>
<li>快速查找指定符号（symbol）位置。</li>
<li>定位 symbol 定义和引用。</li>
<li>允许重复 tag。</li>
<li>查找匹配指定模式的路径。</li>
<li>默认分层搜索。</li>
<li>搜索工程源码和依赖的库源码。</li>
<li>为补全输入方法生成补全列表。</li>
<li>支持多种输出格式。</li>
<li>允许自定义用来标记的候选文件。</li>
<li>支持 POSIX 1003.2 正则表达式。</li>
<li>支持 idutils 作为外部的搜索引擎。</li>
<li>tag 文件独立于机器架构。</li>
<li>支持增量更新标记文件。</li>
<li>通过解析器插件来支持新语言。</li>
<li>通过 gtags.conf 来进行定制。</li>
<li>为源码生成超文本文件。</li>
<li>格式紧凑，节省磁盘空间。</li>
<li>支持客户端/服务器环境（使用 Tramp）。</li>
<li>忽略二进制文件、点文件和指定文件。</li>
<li>包含兼容 cscope 的程序（gtags-cscope）。</li>
<li>包含 grep-like 命令（-g command）。</li>
<li>支持 grep-like 符号高亮。</li>
</ul>
</div>
</div>

<div id="outline-container-orgdf2bb82" class="outline-2">
<h2 id="orgdf2bb82"><span class="section-number-2">2</span> Command line</h2>
<div class="outline-text-2" id="text-2">
<p>
可以通过命令行使用 tag 工具。和其他 tag 系统相比，这是 Global 的一大优点。
</p>
</div>
<div id="outline-container-org5da3814" class="outline-3">
<h3 id="org5da3814"><span class="section-number-3">2.1</span> 准备工作</h3>
<div class="outline-text-3" id="text-2-1">
<p>
开始前，先去阅读 FAQ 文件。
</p>
<div class="org-src-container">
<pre class="src src-sh">more /usr/local/share/gtags/FAQ
</pre>
</div>

<p>
首先必须在源码树根目录执行 gtags，例如，如果想浏览 FreeBSD 中 vi 编辑器源码，请在源码目录中调用 gtags。
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d18aff;">cd</span> /usr/src/usr.bin/vi
gtags
</pre>
</div>

<p>
gtags 遍历子目录，从源码文件中提取符号，在当前目录生成三个 tag 文件。
</p>

<ul class="org-ul">
<li>GTAGS    定义数据库</li>
<li>GRTAGS   引用数据库</li>
<li>GPATH    路径名数据库</li>
</ul>

<p>
此后，当前目录中的所有文件和目录都会被当作一个项目。
</p>

<p>
应该为 tag 文件准备相当大的磁盘空间，例如，linux-2.6.32 源码需以下磁盘空间：
</p>

<pre class="example">
source code(Linux-2.6.32)       390MB

GPATH                             6MB
GTAGS                            81MB
GRTAGS                          202MB
-------------------------------------
total of tag files              289MB
</pre>
</div>
</div>

<div id="outline-container-org325485b" class="outline-3">
<h3 id="org325485b"><span class="section-number-3">2.2</span> 基本使用</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgdcab8b8" class="outline-4">
<h4 id="orgdcab8b8"><span class="section-number-4">2.2.1</span> 查找定义</h4>
<div class="outline-text-4" id="text-2-2-1">
<pre class="example">
$global func1
DIR1/fileB.c            # func1() is defined in fileB.c
</pre>
</div>
</div>

<div id="outline-container-orga7f4355" class="outline-4">
<h4 id="orga7f4355"><span class="section-number-4">2.2.2</span> 查找引用</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
使用 <code>-r</code> 查找引用：
</p>
<pre class="example">
$global -r func2
../DIR1/fileA.c         # func2() is referred from fileA.c
</pre>
</div>
</div>

<div id="outline-container-org206a259" class="outline-4">
<h4 id="org206a259"><span class="section-number-4">2.2.3</span> 使用 POSIX 正则表达式</h4>
<div class="outline-text-4" id="text-2-2-3">
<pre class="example">
$global 'func[1-3]'
DIR1/fileB.c            # func1, func2 and func3 are matched
DIR2/fileC.c
</pre>
</div>
</div>

<div id="outline-container-org542ee15" class="outline-4">
<h4 id="org542ee15"><span class="section-number-4">2.2.4</span> 查看详细内容</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
<code>-x</code> 选项显示详细信息。它类似于 ctags 的 <code>-x</code> 选项
</p>

<pre class="example">
$global func2
DIR2/fileC.c
$global -x func2
func2              2 DIR2/fileC.c       func2(){ i++; }
func2              4 DIR2/fileC.c       func2(){ i--; }
</pre>
</div>
</div>

<div id="outline-container-org372b1c0" class="outline-4">
<h4 id="org372b1c0"><span class="section-number-4">2.2.5</span> 显示绝对路径</h4>
<div class="outline-text-4" id="text-2-2-5">
<pre class="example">
$global -a func1
/home/user/ROOT/DIR1/fileB.c
</pre>
</div>
</div>

<div id="outline-container-org922e73f" class="outline-4">
<h4 id="org922e73f"><span class="section-number-4">2.2.6</span> 查找符号</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
<code>-s</code> 命令用于查找未在 GTAGS 中定义的符号。
</p>
<pre class="example">
$ global -xs X
X                  1 DIR2/fileC.c #ifdef X
</pre>
</div>
</div>

<div id="outline-container-orgfade21d" class="outline-4">
<h4 id="orgfade21d"><span class="section-number-4">2.2.7</span> 查找指定模式的行</h4>
<div class="outline-text-4" id="text-2-2-7">
<p>
<code>-g</code> 命令定位具有指定模式的行。
</p>
<pre class="example">
$ global -xg '#ifdef'
#ifdef             1 DIR2/fileC.c #ifdef X

</pre>

<p>
它类似于 egrep，但对于源代码读取来说更方便，因为它允许通过项目搜索，并且仅在源文件中搜索。
此外，可以使用各种选项：
</p>
<ul class="org-ul">
<li><code>-O</code>
仅在文本文件中搜索。</li>
<li><code>-o</code>
搜索源文件和文本文件。</li>
<li><code>-l</code>
仅在当前目录下搜索。</li>
</ul>

<p>
-e，-G 和 - i 选项也可用。 用法与 egrep 几乎相同。
</p>

<p>
甚至可以使用 <code>--result=grep</code> 选项将 global 的输出格式更改为 grep 样式。 当然，这些选项甚至可以被其他命令使用。
</p>
</div>
</div>

<div id="outline-container-orga18f794" class="outline-4">
<h4 id="orga18f794"><span class="section-number-4">2.2.8</span> 查找执行模式的路径</h4>
<div class="outline-text-4" id="text-2-2-8">
<p>
<code>-P</code> 命令定位包含指定模式的路径名。
</p>
<pre class="example">
$ global -P fileB
DIR1/fileB.c
$ global -P '1/'
DIR1/fileA.c
DIR1/fileB.c
$ global -P '\.c$'
DIR1/fileA.c
DIR1/fileB.c
DIR2/fileC.c
</pre>
</div>
</div>

<div id="outline-container-org8e6b27c" class="outline-4">
<h4 id="org8e6b27c"><span class="section-number-4">2.2.9</span> 在指定文件中查找符号</h4>
<div class="outline-text-4" id="text-2-2-9">
<p>
<code>-f</code> 命令在打印存在指定 tags 的文件列表。
</p>
<pre class="example">
$ global -f DIR2/fileC.c
func2              2 DIR2/fileC.c   func2(){ i++; }
func2              4 DIR2/fileC.c   func2(){ i--; }
func3              6 DIR2/fileC.c   func3(){
</pre>
</div>
</div>

<div id="outline-container-orgf027061" class="outline-4">
<h4 id="orgf027061"><span class="section-number-4">2.2.10</span> 限制搜索范围</h4>
<div class="outline-text-4" id="text-2-2-10">
<p>
<code>-l</code> 选项限制仅在当前目录下的检索。
</p>
<pre class="example">
$cd DIR1
$ global -xl func[1-3]
func1        1 fileB.c      func1(){...}
</pre>
</div>
</div>
</div>
