content/emacs/modes/gnu-global-manual.org
** 高级使用
   + 指定待标记的候选文件：
	 #+BEGIN_SRC sh
find . -type f -print >/tmp/list     # make a file set
vi /tmp/list                         # customize the file set
gtags -f /tmp/list
	 #+END_SRC

   + 如果源文件在只读设备上，比如 CDROM，则无法在源码树的根目录生成 tag 文件。这种情况下，可通过 GTAGSROOT 环境变量在其他位置生成 tag 文件。
	 #+BEGIN_SRC sh
mkdir /var/dbpath
cd /cdrom/src                 # the root of source tree
gtags /var/dbpath             # make tag files in /var/dbpath
export GTAGSROOT=`pwd`
export GTAGSDBPATH=/var/dbpath
global func
	 #+END_SRC

	 还有另外一种方法。因为 global 还会在 =/usr/obj+<current directory>= 查找 tag 文件，可以如下设置：

	 #+BEGIN_SRC sh
cd /cdrom/src                 # the root of source tree
mkdir -p /usr/obj/cdrom/src
gtags /usr/obj/cdrom/src      # make tag files in /usr/obj/cdrom/src
global func
	 #+END_SRC

	 选项 =-O, --objdir= 选项会自动执行以上操作。

	 通过设置环境变量 =MAKEOBJDIRPREFIX= 更改 obj 目录路径。

   + 如果查找的符号不在源码树中，可以通过环境变量 =GTAGSLIBPATH= 指定库目录。

	 应该在 =GTAGSLIBPATH= 的每个目录都执行 gtags，如果 GTAGS 没有找到，global 会忽略该目录。

	 #+BEGIN_EXAMPLE
$ pwd
/develop/src/mh                 # this is a source project
$ gtags
$ ls G*TAGS
GRTAGS  GTAGS
$ global mhl
uip/mhlsbr.c                    # mhl() is found
$ global strlen                 # strlen() is not found
$ (cd /usr/src/lib; gtags)      # library source
$ (cd /usr/src/sys; gtags)      # kernel source
$ export GTAGSLIBPATH=/usr/src/lib:/usr/src/sys
$ global strlen
../../../usr/src/lib/libc/string/strlen.c  # found in library
$ global access
../../../usr/src/sys/kern/vfs_syscalls.c   # found in kernel
	 #+END_EXAMPLE

	 或者可采用更直接的方式。下面的例子中，认为系统库和内核是我们项目的一部分。

	 #+BEGIN_EXAMPLE
$ ln -s /usr/src/lib .
$ ln -s /usr/src/sys .
$ gtags
$ global strlen
lib/libc/string/strlen.c
$ global access
sys/kern/vfs_syscalls.c
	 #+END_EXAMPLE

   + 如果忘记符号名称，可使用 =-c(complete)= 命令。

	 #+BEGIN_EXAMPLE
$ global -c kmem                # maybe k..k.. kmem..
kmem_alloc
kmem_alloc_pageable
kmem_alloc_wait
kmem_free
kmem_free_wakeup
kmem_init
kmem_malloc
kmem_suballoc                   # This is what I need!
$ global kmem_suballoc
../vm/vm_kern.c
	 #+END_EXAMPLE

   + shell 中 =-c= 命令和 complete 命令一起使用。In Bash:
	 #+BEGIN_EXAMPLE
$ funcs()
> {
>         local cur
>         cur=${COMP_WORDS[COMP_CWORD]}
>         COMPREPLY=(`global -c $cur`)
> }
$ complete -F funcs global
$ global kmem_<TAB><TAB>
kmem_alloc           kmem_alloc_wait      kmem_init
kmem_alloc_nofault   kmem_free            kmem_malloc
kmem_alloc_pageable  kmem_free_wakeup     kmem_suballoc
$ global kmem_s<TAB>
$ global kmem_suballoc
../vm/vm_kern.c
	 #+END_EXAMPLE

	 如果喜欢输入补全，试试 globash。它可在没有任何准备的情况下使用。

   + 可以编辑包含指定 tag 的所有文件。例如：

	 #+BEGIN_EXAMPLE
   $ vi `global func1`     # edit fileB.c
	 #+END_EXAMPLE

   + 如果想按序浏览很多文件，需如下操作：
	 #+BEGIN_EXAMPLE
$ global -xr fork | awk '{printf "view +%s %s\n",$2,$3}'
view +650 ../dev/aic7xxx/aic7xxx_asm.c
view +250 ibcs2/ibcs2_misc.c
view +401 linux/linux_misc.c
view +310 ../kern/init_main.c
view +318 ../kern/init_main.c
view +336 ../kern/init_main.c
view +351 ../kern/init_main.c
$ !! | sh            # from now on, go to next tag with 'ZZ'.
	 #+END_EXAMPLE

* Various applications
** 针对 Bash 的 Global 功能
** Less 使用 GLOBAL
** Nvi-1.81.5 使用 GLOBAL
** Elvis 使用 GLOBAL
** Vim 使用 GLOBAL
** 使用 GLOBAL 扩展 Emacs
   Emacs 可以使用 GLOBAL 替代 etags 作为 tag 系统。

*** 特性
	+ 编辑器中可以使用 GLOBAL 的大部分功能。
	+ 更智能地识别当前 token 和它的类型。
	+ 输入 tag 名字时进行补全。
	+ 支持鼠标。

*** 准备
	首先，完成 global 的准备工作。

	其次，在 emacs 中使用 global，需要加载 =gtags.el= 并执行 =gtags-mode= 函数。

    将自动加载函数写入 =$HOME/.emacs= ，启动 Emacs 并执行 =gtags-mode= 函数。如果将 =gtags.el= 没在标准目录中，则需要将其添加到 =load-path= 。

	#+BEGIN_EXAMPLE
$HOME/.emacs
+------------------------------------------------------p
|(setq load-path (cons "/home/owner/global" load-path))
|(autoload 'gtags-mode "gtags" "" t)

$ emacs

|
|J_:-----Mule: *scratch*       (Lisp Interaction)--L16--All----
|M-x gtags-mode[RET]
+------------------------------------------------------
	#+END_EXAMPLE

    如果想在进入 =c-mode= 时进入 =gtags-mode=，将以下代码附加到你的 =$HOME/.emacs= 中。
	#+BEGIN_SRC elisp
(setq c-mode-hook
	  '(lambda ()
		 (gtags-mode 1)
		 ))
	#+END_SRC

	关于键映射，请参阅 =gtags.el= 的注释。

*** 使用
	+ 跳转 func1, 请调用 =gtags-find-tag= ，可以在 =mini-buffer= 中看到提示。然后输入 tag 名称。
	  #+BEGIN_EXAMPLE
    Find tag: func1			<- 'Find tag: ' is a prompt
	  #+END_EXAMPLE
	+ 跳转到 func1 的引用, 调用 =gtags-find-rtag= 。
	  #+BEGIN_EXAMPLE
    Find tag (reference): func1
	  #+END_EXAMPLE
	+ 补全 tag 名称。
	  #+BEGIN_EXAMPLE
Find tag: fuTAB

Find tag: func1                     <- 'nc1' is appended by emacs
	  #+END_EXAMPLE
	+ 如果找到了许多 tag，Emacs 会进入如下的 =GTAGS SELECT MODE= ：
	  #+BEGIN_EXAMPLE
+-------------------------------------------------------------
|main             347 i386/isa/ultra14f.c main()
|main             128 kern/init_main.c   main(framep)
|main             104 netiso/clnp_debug.c main()
|main             164 netiso/xebec/main.c main(argc, argv)
|
|
|
|
|
|J_:--%*-Mule: *scratch*       (Gtags Select)--L1--All----
|[GTAGS SELECT MODE] 4 lines
+-------------------------------------------------------------
	  #+END_EXAMPLE
      通过任何 Emacs 命令选择一个 tag 行并按下 RET，然后可以转到 tag。当想要转到下一个或上一个 tag 时，请使用 =gtags-pop-stack= 返回上述模式并重新选择。

      可通过设置 =gtags-path-style= 变量来设置此模式下自定义路径样式：

	  + root

		相对于项目的根目录（默认）。

	  + relative

		相对于当前目录。

	  + absolute

		绝对路径。

        有两种方法设置该变量：
        + 可以使用 Emacs 的 customize 命令动态更改。可在 Programming/Tools/Gtags 组中找到该条目。
        + 当 Emacs 使用如下所示的.emacs 文件加载时更改：
	      #+BEGIN_SRC elisp
(setq gtags-mode-hook
	  '(lambda ()
		 (setq gtags-path-style 'relative)))
		#+END_SRC

	+ gtags-find-tag-from-here 可用。

	  如果当前 token 是定义，它就等同于查找 tag 引用，否则是查找 tag 定义。

	+ 要找到未在 GTAGS 中定义的符号，请尝试 gtags-find-symbol。
      #+BEGIN_EXAMPLE
Find symbol: lbolt          <- 'Find symbol:' is a prompt
      #+END_EXAMPLE

	+ gtags-find-with-grep 查找字符串。
      #+BEGIN_EXAMPLE
Find pattern: Copyright
      #+END_EXAMPLE

	+ 可使用 POSIX 正则表达式。
      #+BEGIN_EXAMPLE
Find tag: ^put_             <- locate tags starting with 'put_'
      #+END_EXAMPLE

	+ 可使用鼠标命令。

	  如使用 X version Emacs, 进行如下尝试:

	  将鼠标光标移至符号名称并单击中键，可以根据上下文转到其定义或引用。在 =GTAGS SELECT MODE= 中，将鼠标光标移动到行上，并点击中键。

	  点击鼠标右键返回之前位置。

** Gtags-cscope
** 超文本生成器
