emacs/modes/gnu-global-manual.html

<div id="outline-container-orgd894993" class="outline-3">
<h3 id="orgd894993"><span class="section-number-3">2.3</span> 高级使用</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><p>
指定待标记的候选文件：
</p>
<div class="org-src-container">
<pre class="src src-sh">find . -type f -print &gt;/tmp/list     <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">make a file set</span>
vi /tmp/list                         <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">customize the file set</span>
gtags -f /tmp/list
</pre>
</div></li>

<li><p>
如果源文件在只读设备上，比如 CDROM，则无法在源码树的根目录生成 tag 文件。这种情况下，可通过 GTAGSROOT 环境变量在其他位置生成 tag 文件。
</p>
<div class="org-src-container">
<pre class="src src-sh">mkdir /var/dbpath
<span style="color: #d18aff;">cd</span> /cdrom/src                 <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">the root of source tree</span>
gtags /var/dbpath             <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">make tag files in /var/dbpath</span>
<span style="color: #d18aff;">export</span> <span style="color: #ff8700;">GTAGSROOT</span>=<span style="color: #fa8072;">`pwd`</span>
<span style="color: #d18aff;">export</span> <span style="color: #ff8700;">GTAGSDBPATH</span>=/var/dbpath
global func
</pre>
</div>

<p>
还有另外一种方法。因为 global 还会在 <code>/usr/obj+&lt;current directory&gt;</code> 查找 tag 文件，可以如下设置：
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d18aff;">cd</span> /cdrom/src                 <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">the root of source tree</span>
mkdir -p /usr/obj/cdrom/src
gtags /usr/obj/cdrom/src      <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">make tag files in /usr/obj/cdrom/src</span>
global func
</pre>
</div>

<p>
选项 <code>-O, --objdir</code> 选项会自动执行以上操作。
</p>

<p>
通过设置环境变量 <code>MAKEOBJDIRPREFIX</code> 更改 obj 目录路径。
</p></li>

<li><p>
如果查找的符号不在源码树中，可以通过环境变量 <code>GTAGSLIBPATH</code> 指定库目录。
</p>

<p>
应该在 <code>GTAGSLIBPATH</code> 的每个目录都执行 gtags，如果 GTAGS 没有找到，global 会忽略该目录。
</p>

<pre class="example">
$ pwd
/develop/src/mh                 # this is a source project
$ gtags
$ ls G*TAGS
GRTAGS  GTAGS
$ global mhl
uip/mhlsbr.c                    # mhl() is found
$ global strlen                 # strlen() is not found
$ (cd /usr/src/lib; gtags)      # library source
$ (cd /usr/src/sys; gtags)      # kernel source
$ export GTAGSLIBPATH=/usr/src/lib:/usr/src/sys
$ global strlen
../../../usr/src/lib/libc/string/strlen.c  # found in library
$ global access
../../../usr/src/sys/kern/vfs_syscalls.c   # found in kernel
</pre>

<p>
或者可采用更直接的方式。下面的例子中，认为系统库和内核是我们项目的一部分。
</p>

<pre class="example">
$ ln -s /usr/src/lib .
$ ln -s /usr/src/sys .
$ gtags
$ global strlen
lib/libc/string/strlen.c
$ global access
sys/kern/vfs_syscalls.c
</pre></li>

<li><p>
如果忘记符号名称，可使用 <code>-c(complete)</code> 命令。
</p>

<pre class="example">
$ global -c kmem                # maybe k..k.. kmem..
kmem_alloc
kmem_alloc_pageable
kmem_alloc_wait
kmem_free
kmem_free_wakeup
kmem_init
kmem_malloc
kmem_suballoc                   # This is what I need!
$ global kmem_suballoc
../vm/vm_kern.c
</pre></li>

<li><p>
shell 中 <code>-c</code> 命令和 complete 命令一起使用。In Bash:
</p>
<pre class="example">
$ funcs()
&gt; {
&gt;         local cur
&gt;         cur=${COMP_WORDS[COMP_CWORD]}
&gt;         COMPREPLY=(`global -c $cur`)
&gt; }
$ complete -F funcs global
$ global kmem_&lt;TAB&gt;&lt;TAB&gt;
kmem_alloc           kmem_alloc_wait      kmem_init
kmem_alloc_nofault   kmem_free            kmem_malloc
kmem_alloc_pageable  kmem_free_wakeup     kmem_suballoc
$ global kmem_s&lt;TAB&gt;
$ global kmem_suballoc
../vm/vm_kern.c
</pre>

<p>
如果喜欢输入补全，试试 globash。它可在没有任何准备的情况下使用。
</p></li>

<li><p>
可以编辑包含指定 tag 的所有文件。例如：
</p>

<pre class="example">
   $ vi `global func1`     # edit fileB.c
</pre></li>

<li><p>
如果想按序浏览很多文件，需如下操作：
</p>
<pre class="example">
$ global -xr fork | awk '{printf "view +%s %s\n",$2,$3}'
view +650 ../dev/aic7xxx/aic7xxx_asm.c
view +250 ibcs2/ibcs2_misc.c
view +401 linux/linux_misc.c
view +310 ../kern/init_main.c
view +318 ../kern/init_main.c
view +336 ../kern/init_main.c
view +351 ../kern/init_main.c
$ !! | sh            # from now on, go to next tag with 'ZZ'.
</pre></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9e51d04" class="outline-2">
<h2 id="org9e51d04"><span class="section-number-2">3</span> Various applications</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org08d09de" class="outline-3">
<h3 id="org08d09de"><span class="section-number-3">3.1</span> 针对 Bash 的 Global 功能</h3>
</div>
<div id="outline-container-org297ba53" class="outline-3">
<h3 id="org297ba53"><span class="section-number-3">3.2</span> Less 使用 GLOBAL</h3>
</div>
<div id="outline-container-org3f8873e" class="outline-3">
<h3 id="org3f8873e"><span class="section-number-3">3.3</span> Nvi-1.81.5 使用 GLOBAL</h3>
</div>
<div id="outline-container-orgc43e983" class="outline-3">
<h3 id="orgc43e983"><span class="section-number-3">3.4</span> Elvis 使用 GLOBAL</h3>
</div>
<div id="outline-container-org0354e7b" class="outline-3">
<h3 id="org0354e7b"><span class="section-number-3">3.5</span> Vim 使用 GLOBAL</h3>
</div>
<div id="outline-container-org128198b" class="outline-3">
<h3 id="org128198b"><span class="section-number-3">3.6</span> 使用 GLOBAL 扩展 Emacs</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Emacs 可以使用 GLOBAL 替代 etags 作为 tag 系统。
</p>
</div>

<div id="outline-container-org02e4def" class="outline-4">
<h4 id="org02e4def"><span class="section-number-4">3.6.1</span> 特性</h4>
<div class="outline-text-4" id="text-3-6-1">
<ul class="org-ul">
<li>编辑器中可以使用 GLOBAL 的大部分功能。</li>
<li>更智能地识别当前 token 和它的类型。</li>
<li>输入 tag 名字时进行补全。</li>
<li>支持鼠标。</li>
</ul>
</div>
</div>

<div id="outline-container-org1731474" class="outline-4">
<h4 id="org1731474"><span class="section-number-4">3.6.2</span> 准备</h4>
<div class="outline-text-4" id="text-3-6-2">
<p>
首先，完成 global 的准备工作。
</p>

<p>
其次，在 emacs 中使用 global，需要加载 <code>gtags.el</code> 并执行 <code>gtags-mode</code> 函数。
</p>

<p>
将自动加载函数写入 <code>$HOME/.emacs</code> ，启动 Emacs 并执行 <code>gtags-mode</code> 函数。如果将 <code>gtags.el</code> 没在标准目录中，则需要将其添加到 <code>load-path</code> 。
</p>

<pre class="example">
$HOME/.emacs
+------------------------------------------------------p
|(setq load-path (cons "/home/owner/global" load-path))
|(autoload 'gtags-mode "gtags" "" t)

$ emacs

|
|J_:-----Mule: *scratch*       (Lisp Interaction)--L16--All----
|M-x gtags-mode[RET]
+------------------------------------------------------
</pre>

<p>
如果想在进入 <code>c-mode</code> 时进入 <code>gtags-mode=，将以下代码附加到你的 =$HOME/.emacs</code> 中。
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> c-mode-hook
      '(lambda ()
         (gtags-mode 1)
         ))
</pre>
</div>

<p>
关于键映射，请参阅 <code>gtags.el</code> 的注释。
</p>
</div>
</div>

<div id="outline-container-org29d71b2" class="outline-4">
<h4 id="org29d71b2"><span class="section-number-4">3.6.3</span> 使用</h4>
<div class="outline-text-4" id="text-3-6-3">
<ul class="org-ul">
<li><p>
跳转 func1, 请调用 <code>gtags-find-tag</code> ，可以在 <code>mini-buffer</code> 中看到提示。然后输入 tag 名称。
</p>
<pre class="example">
    Find tag: func1			&lt;- 'Find tag: ' is a prompt
</pre></li>
<li><p>
跳转到 func1 的引用, 调用 <code>gtags-find-rtag</code> 。
</p>
<pre class="example">
    Find tag (reference): func1
</pre></li>
<li><p>
补全 tag 名称。
</p>
<pre class="example">
Find tag: fuTAB

Find tag: func1                     &lt;- 'nc1' is appended by emacs
</pre></li>
<li><p>
如果找到了许多 tag，Emacs 会进入如下的 <code>GTAGS SELECT MODE</code> ：
</p>
<pre class="example">
+-------------------------------------------------------------
|main             347 i386/isa/ultra14f.c main()
|main             128 kern/init_main.c   main(framep)
|main             104 netiso/clnp_debug.c main()
|main             164 netiso/xebec/main.c main(argc, argv)
|
|
|
|
|
|J_:--%*-Mule: *scratch*       (Gtags Select)--L1--All----
|[GTAGS SELECT MODE] 4 lines
+-------------------------------------------------------------
</pre>
<p>
通过任何 Emacs 命令选择一个 tag 行并按下 RET，然后可以转到 tag。当想要转到下一个或上一个 tag 时，请使用 <code>gtags-pop-stack</code> 返回上述模式并重新选择。
</p>

<p>
可通过设置 <code>gtags-path-style</code> 变量来设置此模式下自定义路径样式：
</p>

<ul class="org-ul">
<li><p>
root
</p>

<p>
相对于项目的根目录（默认）。
</p></li>

<li><p>
relative
</p>

<p>
相对于当前目录。
</p></li>

<li><p>
absolute
</p>

<p>
绝对路径。
</p>

<p>
有两种方法设置该变量：
</p>
<ul class="org-ul">
<li>可以使用 Emacs 的 customize 命令动态更改。可在 Programming/Tools/Gtags 组中找到该条目。</li>
<li><p>
当 Emacs 使用如下所示的.emacs 文件加载时更改：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> gtags-mode-hook
      '(lambda ()
         (<span style="color: #a1db00;">setq</span> gtags-path-style 'relative)))
</pre>
</div></li>
</ul></li>
</ul></li>

<li><p>
gtags-find-tag-from-here 可用。
</p>

<p>
如果当前 token 是定义，它就等同于查找 tag 引用，否则是查找 tag 定义。
</p></li>

<li><p>
要找到未在 GTAGS 中定义的符号，请尝试 gtags-find-symbol。
</p>
<pre class="example">
Find symbol: lbolt          &lt;- 'Find symbol:' is a prompt
</pre></li>

<li><p>
gtags-find-with-grep 查找字符串。
</p>
<pre class="example">
Find pattern: Copyright
</pre></li>

<li><p>
可使用 POSIX 正则表达式。
</p>
<pre class="example">
Find tag: ^put_             &lt;- locate tags starting with 'put_'
</pre></li>

<li><p>
可使用鼠标命令。
</p>

<p>
如使用 X version Emacs, 进行如下尝试:
</p>

<p>
将鼠标光标移至符号名称并单击中键，可以根据上下文转到其定义或引用。在 <code>GTAGS SELECT MODE</code> 中，将鼠标光标移动到行上，并点击中键。
</p>

<p>
点击鼠标右键返回之前位置。
</p></li>
</ul>
</div>
</div>
</div>
