content/emacs/modes/gnu-global-manual.org
** Doxygen 使用 GLOBAL
* Command References
** global - 打印给定符号未知
** gtags - 为 global 创建 tag 文件
** htags - 从源文件生成超文本
** htags-server - 为 htags 启动专用 Web/CGI server
** gozilla - 强制浏览器显示源文件的指定部分
** gtags-cscope - 交互式地检查一个 C 程序
** globash - 使用 GNU bash 的 GLOBAL 特殊 shell
** gtags.conf - GNU GLOBAL 的配置数据
    gtags.conf 用来配置 global(1), gozilla(1), gtags(1) and htags(1). 这些工具按以下顺序查找配置，并从第一个存在并可读的文件中读取。
    1. =--gtagsconf file= （命令行参数）
    2. =$GTAGSCONF= （环境变量）
    3. =[project root]/gtags.conf=
    4. =[project root]/[objdir]/gtags.conf=
    5. =$HOME/.globalrc=
    6. =/etc/gtags.conf=
    7. =[sysconfdir]/gtags.conf=

    [sysconfdir] 默认是 =/usr/local/etc= ; 可通过配置文件中的 =--sysconfdir= 更改. [objdir] 默认是 obj ; 可通过 =GTAGSOBJDIR= 或 =MAKEOBJDIR= 更改。

    除了稍后描述的一些扩展外，语法与 termcap（5）类似。文件包含一个或多个记录。使用标签选择记录。默认标签是'default'。如果设置了 GTAGSLABEL，则使用它的值。请注意'default'的含义与 termcap（5）不同。

    以'#'开始的行被忽略。记录由一个或多个由':'分隔的字段组成，并以换行符结束。第一个字段必须有标签名称。其余的字段是变量定义。这些变量有三种类型：
    + 布尔值：这种类型没有值; 变量的存在意味着 true 否则为 false。
    + 数值：此类型在'#'后面是数字。
    + 字符串：此类型在'='后有字符串值。

    大多数变量都与字符串类型有关。

    如果数据包含':'或换行符，则需要用'\'引用。一个空的域是允许的，但它没有意义。

    如果有多个定义，则采用前一个。例外情况下，skip，langmap 和 gtags_parser 的所有值分别选用并链接在一起。

*** 变量替代
    可用类似于 sh（1）的替换变量。 可以使用'$'前缀引用任何字符串变量。 例如，以下 b 的值为'XYZ'。
    #+BEGIN_SRC sh
:a=Y:b=X${a}Z:
    #+END_SRC

*** 包含其他记录
    Tc 是一个特殊的变量; 它读入另一条记录中的定义。 它与 termcap（5）的 tc 类似。 语法如下：
    #+BEGIN_SRC
tc=label[@file]
    #+END_SRC

    如果仅给出标签，tc 读取同文件中的标签指定的记录。 如果还给出 =@file= ，则从指定文件中读取标签指定的记录。 文件应该是绝对路径，不应该包含变量。 与 termcap（5）不同，可以随时随地使用 tc。

*** 配置项
    关于命令对应的变量，请参阅对应的手册。

    可以将以下环境变量用作字符串变量。 如果设置了这些变量，那么在命令执行前会设置同名的环境变量。
    + GREP_COLOR
    + GREP_COLORS
    + GTAGSBLANKENCODE
    + GTAGSCACHE
    + GTAGSFORCECPP
    + GTAGSGLOBAL
    + GTAGSGTAGS
    + GTAGSLIBPATH
    + GTAGSLOGGING
    + GTAGSTHROUGH
    + GTAGS_OPTIONS
    + HTAGS_OPTIONS
    + MAKEOBJDIR
    + MAKEOBJDIRPREFIX
    + TMPDIR

    以下变量也可用作字符串变量。 默认情况下，它们都有由 configure 脚本给出的目录路径。
    + bindir
    + datadir
    + libdir
    + localstatedir
    + sysconfdir

*** 环境变量
    以下环境变量影响命令的执行：

    + GTAGSCONF

      如果设置了该变量，使用该值对应的配置文件。

    + GTAGSLABEL

      如果设置了该变量，则使用配置文件中该值对应的 label。默认是 default。

* Footnotes
