emacs/modes/gnu-global-manual.html

<div id="outline-container-org3873603" class="outline-3">
<h3 id="org3873603"><span class="section-number-3">3.7</span> Gtags-cscope</h3>
</div>
<div id="outline-container-org420bb0d" class="outline-3">
<h3 id="org420bb0d"><span class="section-number-3">3.8</span> 超文本生成器</h3>
</div>
<div id="outline-container-org06d6471" class="outline-3">
<h3 id="org06d6471"><span class="section-number-3">3.9</span> Doxygen 使用 GLOBAL</h3>
</div>
</div>
<div id="outline-container-org7c91ffd" class="outline-2">
<h2 id="org7c91ffd"><span class="section-number-2">4</span> Command References</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge0b1838" class="outline-3">
<h3 id="orge0b1838"><span class="section-number-3">4.1</span> global - 打印给定符号未知</h3>
</div>
<div id="outline-container-org551dff6" class="outline-3">
<h3 id="org551dff6"><span class="section-number-3">4.2</span> gtags - 为 global 创建 tag 文件</h3>
</div>
<div id="outline-container-orge2ee9aa" class="outline-3">
<h3 id="orge2ee9aa"><span class="section-number-3">4.3</span> htags - 从源文件生成超文本</h3>
</div>
<div id="outline-container-org55d1212" class="outline-3">
<h3 id="org55d1212"><span class="section-number-3">4.4</span> htags-server - 为 htags 启动专用 Web/CGI server</h3>
</div>
<div id="outline-container-org70ee11b" class="outline-3">
<h3 id="org70ee11b"><span class="section-number-3">4.5</span> gozilla - 强制浏览器显示源文件的指定部分</h3>
</div>
<div id="outline-container-orgb34bc43" class="outline-3">
<h3 id="orgb34bc43"><span class="section-number-3">4.6</span> gtags-cscope - 交互式地检查一个 C 程序</h3>
</div>
<div id="outline-container-org4c13da1" class="outline-3">
<h3 id="org4c13da1"><span class="section-number-3">4.7</span> globash - 使用 GNU bash 的 GLOBAL 特殊 shell</h3>
</div>
<div id="outline-container-org15a59ac" class="outline-3">
<h3 id="org15a59ac"><span class="section-number-3">4.8</span> gtags.conf - GNU GLOBAL 的配置数据</h3>
<div class="outline-text-3" id="text-4-8">
<p>
gtags.conf 用来配置 global(1), gozilla(1), gtags(1) and htags(1). 这些工具按以下顺序查找配置，并从第一个存在并可读的文件中读取。
</p>
<ol class="org-ol">
<li><code>--gtagsconf file</code> （命令行参数）</li>
<li><code>$GTAGSCONF</code> （环境变量）</li>
<li><code>[project root]/gtags.conf</code></li>
<li><code>[project root]/[objdir]/gtags.conf</code></li>
<li><code>$HOME/.globalrc</code></li>
<li><code>/etc/gtags.conf</code></li>
<li><code>[sysconfdir]/gtags.conf</code></li>
</ol>

<p>
[sysconfdir] 默认是 <code>/usr/local/etc</code> ; 可通过配置文件中的 <code>--sysconfdir</code> 更改. [objdir] 默认是 obj ; 可通过 <code>GTAGSOBJDIR</code> 或 <code>MAKEOBJDIR</code> 更改。
</p>

<p>
除了稍后描述的一些扩展外，语法与 termcap（5）类似。文件包含一个或多个记录。使用标签选择记录。默认标签是'default'。如果设置了 GTAGSLABEL，则使用它的值。请注意'default'的含义与 termcap（5）不同。
</p>

<p>
以'#'开始的行被忽略。记录由一个或多个由':'分隔的字段组成，并以换行符结束。第一个字段必须有标签名称。其余的字段是变量定义。这些变量有三种类型：
</p>
<ul class="org-ul">
<li>布尔值：这种类型没有值; 变量的存在意味着 true 否则为 false。</li>
<li>数值：此类型在'#'后面是数字。</li>
<li>字符串：此类型在'='后有字符串值。</li>
</ul>

<p>
大多数变量都与字符串类型有关。
</p>

<p>
如果数据包含':'或换行符，则需要用'\'引用。一个空的域是允许的，但它没有意义。
</p>

<p>
如果有多个定义，则采用前一个。例外情况下，skip，langmap 和 gtags_parser 的所有值分别选用并链接在一起。
</p>
</div>

<div id="outline-container-org09d1079" class="outline-4">
<h4 id="org09d1079"><span class="section-number-4">4.8.1</span> 变量替代</h4>
<div class="outline-text-4" id="text-4-8-1">
<p>
可用类似于 sh（1）的替换变量。 可以使用'$'前缀引用任何字符串变量。 例如，以下 b 的值为'XYZ'。
</p>
<div class="org-src-container">
<pre class="src src-sh">:<span style="color: #ff8700;">a</span>=Y:<span style="color: #ff8700;">b</span>=X${<span style="color: #ff8700;">a</span>}Z:
</pre>
</div>
</div>
</div>

<div id="outline-container-org68d6e25" class="outline-4">
<h4 id="org68d6e25"><span class="section-number-4">4.8.2</span> 包含其他记录</h4>
<div class="outline-text-4" id="text-4-8-2">
<p>
Tc 是一个特殊的变量; 它读入另一条记录中的定义。 它与 termcap（5）的 tc 类似。 语法如下：
</p>
<pre class="example">
tc=label[@file]
</pre>

<p>
如果仅给出标签，tc 读取同文件中的标签指定的记录。 如果还给出 <code>@file</code> ，则从指定文件中读取标签指定的记录。 文件应该是绝对路径，不应该包含变量。 与 termcap（5）不同，可以随时随地使用 tc。
</p>
</div>
</div>

<div id="outline-container-org687147d" class="outline-4">
<h4 id="org687147d"><span class="section-number-4">4.8.3</span> 配置项</h4>
<div class="outline-text-4" id="text-4-8-3">
<p>
关于命令对应的变量，请参阅对应的手册。
</p>

<p>
可以将以下环境变量用作字符串变量。 如果设置了这些变量，那么在命令执行前会设置同名的环境变量。
</p>
<ul class="org-ul">
<li>GREP_COLOR</li>
<li>GREP_COLORS</li>
<li>GTAGSBLANKENCODE</li>
<li>GTAGSCACHE</li>
<li>GTAGSFORCECPP</li>
<li>GTAGSGLOBAL</li>
<li>GTAGSGTAGS</li>
<li>GTAGSLIBPATH</li>
<li>GTAGSLOGGING</li>
<li>GTAGSTHROUGH</li>
<li>GTAGS_OPTIONS</li>
<li>HTAGS_OPTIONS</li>
<li>MAKEOBJDIR</li>
<li>MAKEOBJDIRPREFIX</li>
<li>TMPDIR</li>
</ul>

<p>
以下变量也可用作字符串变量。 默认情况下，它们都有由 configure 脚本给出的目录路径。
</p>
<ul class="org-ul">
<li>bindir</li>
<li>datadir</li>
<li>libdir</li>
<li>localstatedir</li>
<li>sysconfdir</li>
</ul>
</div>
</div>

<div id="outline-container-orgd8f5e2c" class="outline-4">
<h4 id="orgd8f5e2c"><span class="section-number-4">4.8.4</span> 环境变量</h4>
<div class="outline-text-4" id="text-4-8-4">
<p>
以下环境变量影响命令的执行：
</p>

<ul class="org-ul">
<li><p>
GTAGSCONF
</p>

<p>
如果设置了该变量，使用该值对应的配置文件。
</p></li>

<li><p>
GTAGSLABEL
</p>

<p>
如果设置了该变量，则使用配置文件中该值对应的 label。默认是 default。
</p></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2019-09-10 二 19:58</p>
<p class="validation"></p>
</div>
</body>
</html>
